Revit 2025 API
DesignToFabricationConverterResult Enumeration
 Possible results from invoking the DesignToFabricationConverter.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DesignToFabricationConverterResult
Public Enumeration DesignToFabricationConverterResult
public enum class DesignToFabricationConverterResult
type DesignToFabricationConverterResult
Members
Member name | Value | Description
Success | 0 |  Conversion was successful.
PartialFailure | 1 |  Conversion contained partial failures and will need to be fixed manually.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace